# _*_ coding=utf-8 _*_
"""
向量是同时具有大小和方向的量，向量可以在平面内，也可以在空间内（三维坐标系）
虽然多了一个纬度，但是没有改变其本质。即使用有向线段来表示向量的大小与方向。长度就是向量的大小，或者，模
模记作|→a|  #箭头在上面打不出来

单位向量：是指模等于1的向量，没有规定方向，所以在任意一个给定方向都有单位向量，单位向量是有无限多的

零向量：记作|→0|,方向是任意的，是唯一的，大小为0

共线向量（平行向量）：向量是可以自由移动的，空间向量也是在空间可以自由移动的，如果他们在同一条基线上，或者通过平移可以移动到同一条基线上，就称为，共线向量

由于零向量方向是任意的，所以与任意向量都是共线向量

三维空间中向量坐标为（a, b, c），模（大小）为√￣￣（a^2 + b^2 + c^2） # √￣是根号下的意思

https://www.bilibili.com/video/BV1qb411M7wL/?spm_id_from=333.337.search-card.all.click&vd_source=9f33dd7a5eac6a4ec0b3028a044ffe9d




"""